ezois_ka/oooezoiskaobmen/src/InformationRegisters/ЖурналОтчетовСтатусы/ЖурналОтчетовСтатусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтчетовСтатусы</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтролирующегоОргана</name>
    <type>
      <types>EnumRef.ТипыКонтролирующихОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтчета</name>
    <comment>Корректировочный номер (0 - Первичный).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйПериод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостояниеСдачиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправляетсяВКонтролирующийОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибкиОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрочтенное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/ЖурналОтправокВКонтролирующиеОрганы/ЖурналОтправокВКонтролирующиеОрганы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтправокВКонтролирующиеОрганы</name>
  <resources>
    <name>СтатусОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидКонтролирующегоОргана</name>
    <type>
      <types>EnumRef.ТипыКонтролирующихОрганов</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибкиОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПриcоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправляетсяВКонтролирующийОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрочтенное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостояниеСдачиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументовВЖурнале</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтраницаЖурнала</name>
    <type>
      <types>EnumRef.СтраницыЖурналаОтчетность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Documents/РегламентированныйОтчет/РегламентированныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентированныйОтчет</name>
  <comment>Регламентированный отчет</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Вид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетности</name>
    <comment>Вид отчетности</comment>
    <type>
      <types>EnumRef.ВидыОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбраннаяФорма</name>
    <comment>Выбранная форма</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <comment>Сохраненные данные отчета</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоНастройкиСтраниц</name>
    <comment>Дерево со списком настроек страниц</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения</comment>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОтчета</name>
    <comment>Имя встроенной или имя файла внешней обработки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОрганаПосредника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтчета</name>
    <comment>Наименование регламентированного отчета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПачки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЕдиницыИзмерения</name>
    <comment>Точность единицы измерения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>DefinedType.СправочникБанкиБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ВыгрузкаРегламентированныхОтчетов/ВыгрузкаРегламентированныхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыгрузкаРегламентированныхОтчетов</name>
  <registerRecords>InformationRegister.АрхивДанныхРегламентированнойОтчетности</registerRecords>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоНалоговомуОргану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Основная</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.РегламентированныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТекстаВыгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выгрузки</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВерсииФорматовВыгрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/CommonModules/ОбновлениеИнформационнойБазыБРО/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки РегламентированнаяОтчетность (БРО).
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Объявление библиотеки.

// Описание этой же процедуры смотрите в модуле ОбновлениеИнформационнойБазыБСП.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "РегламентированнаяОтчетность";
	Описание.Версия = "1.2.1.302";
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий обновления информационной базы.

// Описание этой же процедуры смотрите в модуле ОбновлениеИнформационнойБазыБСП.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "РегламентированнаяОтчетность.ВыполнитьОбновлениеИнформационнойБазы";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "РегламентированнаяОтчетность.ОтключитьВнешнийМодульДокументооборотаСФНС";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.УправлениеОбработчиками = Истина;
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБРО.ЗаполнитьОбработчикиРазделенныхДанных";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ОчиститьВнешниеРеглОтчеты";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.0.0.1";
	Обработчик.Процедура = "РегистрыСведений.СкрытыеРегламентированныеОтчеты.ДобавитьСкрытыеОтчетыВРегистрСведений";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.0.0.1";
	Обработчик.Процедура = "РегламентированнаяОтчетность.ЗаменитьСсылкиРазделенныйСпрУдалитьРеглОтчетыНаНеРазделенныйСпрРеглОтчеты";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "РегистрыСведений.СправочникиШаблоновОтчетовСтатистики.ОчиститьСправочникиШаблонов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0e41f0bb-ee46-46c8-817c-19e8021171e2");
	Обработчик.Комментарий = НСтр("ru = 'Выполняет очистку справочников статистических отчетов.
		|До завершения выполнения работа со справочниками может быть затруднена.'");
	
	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.Процедура = "РегистрыСведений.ОбщиеСправочникиШаблоновОтчетовСтатистики.ЗаполнитьРегистрСправочникамиШаблонов";
		Обработчик.РежимВыполнения = "Оперативно";
		Обработчик.ОбщиеДанные = Истина;
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("af2ab03f-b869-40fd-8177-08836d37ec60");
		Обработчик.Комментарий = НСтр("ru = 'Выполняет заполнение неразделенного регистра справочниками статистических отчетов.
			|До завершения выполнения работа со справочниками может быть затруднена.'");
	КонецЕсли;
	
	// Конвертация статусов регламентированных отчетов после перехода с 2.0.
	//
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.0.0.1";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьСтатусыНеОтправлявшихсяРеглОтчетов";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.13";
	Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияДекларацийПоАлкоголю";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.13";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияДекларацийПоАлкоголю";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.13";
	Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияРеестровПоНДС";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований реестров по НДС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.13";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияРеестровПоНДС";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований реестров по НДС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.14";
	Обработчик.Процедура = "Справочники.ВидыОтправляемыхДокументов.ИсправитьОписаниеДекларацийПоАлкоголюРеестровПоНДС";
			
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.19";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ЗаполнитьИндексКартинкиРеглОтчетов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет заполнение индекса картинки регламентированных отчетов.'");
			
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.9.22";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИсправитьРеквизитыОтправкиСправокОРублевыхИВалютныхСчетах";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение реквизитов отправки справок о рублевых и валютных счетах.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.11.9";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьСтатусыНеОтправлявшихсяРеглОтчетов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.11.9";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтправокВКонтролирующиеОрганы.ИзменитьСтатусыНеОтправлявшихсяУведомлений";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьПоАлкогольнойПродукции") Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.1.11.12";
		Обработчик.Процедура = "РегламентированнаяОтчетностьАЛКО.ПриОбновленииИБЗаполнитьИзмерениеОрганизацияАлко";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7777-a06b-c1980bebebbf");
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет заполнение измерения Организация в регистрах сведений алкогольной отчетности.'");
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.11.36";
	Обработчик.Процедура = "Справочники.ВидыОтправляемыхДокументов.ИсправитьВидыОтправляемыхДокументовСЗВК";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.11.37";
	Обработчик.Процедура = "Справочники.ВидыОтправляемыхДокументов.ИзменитьОписаниеДекларацийПоКосвеннымНалогам";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.12.19";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьВидИКодКонтролирующегоОрганаПодтвержденийВидаДеятельности";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.12.19";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьВидКонтролирующегоОрганаСоответствийУсловийТруда";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.13.5";
	Обработчик.Процедура = "ОнлайнСервисыРегламентированнойОтчетностиВызовСервера.ВключитьМеханизмОнлайнСервисовРО";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.13.5";
	Обработчик.Процедура = "РегистрыСведений.РесурсыМеханизмаОнлайнСервисовРО.ПеренестиДанныеИзРазделенногоРегистра";
	Обработчик.ОбщиеДанные = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.13.5";
	Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияДекларацийПоФармАлкоголю";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7778-a06b-c1980bebebbf");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по фармакопейному алкоголю.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.13.5";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияДекларацийПоФармАлкоголю";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7779-a06b-c1980bebebbf");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по фармакопейному алкоголю.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.13.5";
	Обработчик.Процедура = "Документы.ВыгрузкаРегламентированныхОтчетов.УдалитьПояснительныеЗапискиЕНВД";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьВМинистерствоОбороны") Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия    = "1.1.13.5";
		Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.УдалитьРеглОтчетИсполнениеКонтрактовГОЗИзГруппыОтчетностьПрочая";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьПоАлкогольнойПродукции") Тогда
			
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.11";
		Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияДекларацийПоАлкоголю4кв2019";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7780-a06b-c1980bebebbf");
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.11";
		Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияДекларацийПоАлкоголю4кв2019";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7781-a06b-c1980bebebbf");
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
				
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьВБанки") Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.26";
		Обработчик.Процедура = "РегистрыСведений.НастройкиОтправкиОтчетностиВБанк.ИзменитьРасписаниеОтправкиНаЕжедневное";
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("15d1146a-c3a0-4714-98ab-333e56595a5d");
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение расписания автоматической отправки финансовой отчетности в Сбербанк'");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ОтчетностьПоАлкогольнойПродукции") Тогда
			
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.76";
		Обработчик.Процедура = "Справочники.ВидыОтправляемыхДокументов.ИзменитьОписаниеДекларацийПоФСРАР2021кв1";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7783-a06b-c1980bebebbf");
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
			
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.76";
		Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияДекларацийПоФСРАР2021кв1";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7784-a06b-c1980bebebbf");
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.76";
		Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияДекларацийПоФСРАР2021кв1";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("559a5d02-e3cd-7785-a06b-c1980bebebbf");
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований деклараций по алкоголю.'");
				
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.1.225";
	Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияРеестровПоНДС_2024";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований реестров по НДС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.1.225";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияРеестровПоНДС_2024";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименований реестров по НДС.'");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.БухгалтерскаяОтчетность") Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.246";
		Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованиеБухгалтерскойОтчетности";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор();
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименования бухгалтерской отчетности.'");
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "1.2.1.246";
		Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованиеБухгалтерскойОтчетности";
		Обработчик.Идентификатор = Новый УникальныйИдентификатор();
		Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Выполняет изменение наименования бухгалтерской отчетности.'");
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.1.250";
	Обработчик.Процедура = "Документы.РегламентированныйОтчет.ИзменитьНаименованияРеестровПоАкцизамИСчетовФактур_2024";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр(
		"ru = 'Выполняет изменение наименований реестров для налоговых вычетов по акцизам и реестров счетов-фактур.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.1.250";
	Обработчик.Процедура = "РегистрыСведений.ЖурналОтчетовСтатусы.ИзменитьНаименованияРеестровПоАкцизамИСчетовФактур_2024";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор();
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр(
		"ru = 'Выполняет изменение наименований реестров для налоговых вычетов по акцизам и реестров счетов-фактур.'");
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиОбновлениеИнформационнойБазы.ПриДобавленииОбработчиковОбновления(Обработчики);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность.ЕдиныйНалоговыйСчет") Тогда
		МодульЕдиныйНалоговыйСчетИнтеграция = ОбщегоНазначения.ОбщийМодуль("ЕдиныйНалоговыйСчетИнтеграция");
		МодульЕдиныйНалоговыйСчетИнтеграция.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли;
	
КонецПроцедуры

// Описание этой же процедуры смотрите в модуле ОбновлениеИнформационнойБазыБСП.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Описание этой же процедуры смотрите в модуле ОбновлениеИнформационнойБазыБСП.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Описание этой же процедуры смотрите в модуле ОбновлениеИнформационнойБазыБСП.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	// Не используется в БРО.
	
КонецПроцедуры

// Заполняет обработчик разделенных данных, зависимый от изменения неразделенных данных (Обработчик.Версия = "*" поддерживается).
//
// Параметры:
//   Параметры - ТаблицаЗначений, Неопределено - см. описание 
//    функции НоваяТаблицаОбработчиковОбновления общего модуля 
//    ОбновлениеИнформационнойБазы.
//    В случае прямого вызова (не через механизм обновления 
//    версии ИБ) передается Неопределено.
// 
Процедура ЗаполнитьОбработчикиРазделенныхДанных(Параметры = Неопределено) Экспорт
	
	Если Параметры <> Неопределено Тогда
		Обработчики = Параметры.РазделенныеОбработчики;
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.РежимВыполнения = "Оперативно";
		Обработчик.Процедура = "РегламентированнаяОтчетность.ВыполнитьОбновлениеИнформационнойБазы";
		
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиОбновлениеИнформационнойБазы.ДобавитьОбработчикиОбновленияОблачнойПодписи(Обработчики, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
